[
  {
    "id": 1,
    "name": "Backend Web Developer (Ruby on Rails)",
    "job_title": "backend engineer",
    "company_name": "Toptal",
    "location": "Anywhere",
    "company_market": "Software house",
    "type": "Full Time",
    "team_size": "1-10",
    "level": "Mid Level",
    "salary": "$12,000 — $25,000",
    "skills": [
      {
      "name": "HTML"
      }, {
        "name": "CSS"
      }, {
        "name": "Javascript"
      }, {
        "name": "Ruby on Rails"
      }
    ],
    "description": "<h3>Clevertech is hiring a Remote Senior Full Stack Engineer JavaScript</h3><p>Our 100% remote team of 200+ CleverPeople are seasoned yet friendly professionals who want to collaborate and welcome you. We have an exciting new opening for a Senior Full Stack Engineer - Javascript .</p><p>What we're working on Enterprise companies turn to us to help them launch innovative digital products that interact with hundreds of millions of customers, transactions and data points. The problems we solve everyday are real and require creativity, grit and determination. We are building a culture that challenges norms while fostering experimentation and personal growth. We are hiring team members who are passionate and energized by the vision of empowering our customers in a complex industry through technology, data and a deep understanding of client concerns. In order to grasp the scale of problems we face, ideally you have some exposure to Logistics, FinTech, Transportation, Insurance, Media or other complex multifactor industries.</p><strong>Requirements</strong><ul><li>7+ years of professional experience (A technical assessment will be required)</li><li>Senior-level experience in the front-end (React) and back-end (Node, Express Mongo, SQL)</li><li>Ability to create clean, modern, testable, well-documented code</li><li>English fluency, verbal and written</li><li>Professional, empathic, team player</li><li>Problem solver, proactive, go getter</li><li>Be sure to mention the words CLOG REGION DIRECT when applying to show you read the job post completely. This is a beta feature to avoid spam applicants.</li></ul><strong>Salary and compensation</strong><p>$60,000 — $100,000</p><strong>Location</strong><p>🌏 Worldwide</p>"
  },
  {
    "id": 2,
    "name": "Software Engineer",
    "job_title": "software engineer",
    "company_name": "OarRx",
    "location": "Anywhere",
    "company_market": "Software house",
    "type": "Full Time",
    "team_size": "11-50",
    "level": "Mid Level",
    "salary": "$100,000 – $150,000",
    "skills": [
      {
      "name": "Ruby on Rails"
      }, {
        "name": "React Native"
      }
    ],
    "description": "<h3>Software Engineer</h3><p>We are searching for a diligent, hungry-to-learn software developer to join Oar as an Engineer. As a member of our engineering team, you will collaborate with our product and design teams to bring new features to life, building beautiful and interactive experiences that help Oar’s consumers confront addiction and compulsion. Plus, you will work with a talented, diverse team united by its common values: empathy, acceptance, expertise, innovation, integrity, and high performance.</p><p>What excites us about you?</p><ul><li>You are mission-driven, bringing a passion for helping the millions of people who struggle with addiction and compulsion</li><li>You have about 3+ years experience as software developer</li><li>You have familiarity with a smorgasbord of tools. Our favorites include SQL, Heroku, Git, Ruby/Ruby on Rails, HTML5, CSS3, Javascript, and/or React/Redux responsive web design</li><li>You have an entrepreneurial spirit and think proactively about broader business and customer goals</li><li>You like to rely on your keen problem-solving abilities to creatively and efficiently extinguish unexpected challenges</li><li>You are able to build quickly but also have a sense of architecture that can scale well beyond small beta launches</li><li>You enjoy working collaboratively, within a common framework, to build intuitive solutions to complex problems</li><li>You’re intellectually curious, willing to jump into existing projects and learn on the fly</li><li>You bring high conscientiousness, attention to detail, and strong organizational skills</li></ul><p>How we support you:</p><ul><li>Competitive salary</li><li>Paid health insurance coverage</li><li>401k contribution</li><li>MacBook Pro</li><li>Health and Wellness reimbursement</li><li>Commuter benefits</li><li>Complimentary team lunches</li><li>Fun team outings</li><li>Generous vacation time</li></ul>"
  },
  {
    "id": 3,
    "name": "React JS Developer (YCombinator backed startup)",
    "job_title": "frontend engineer",
    "company_name": "Akiflow",
    "company_market": "Software house",
    "location": "Europe",
    "type": "Contract",
    "team_size": "1-10",
    "level": "Mid Level",
    "salary": "$50,000 – $100,000",
    "skills": [
      {
      "name": "Node.js"
      }, {
        "name": "Javascript"
      }, {
        "name": "TypeScript"
      }, {
        "name": "React.js"
      }
    ],
    "description": "<p>We are building Akiflow.com (https://akiflow.com/), and we are looking for a React Developer to join our fully-remote international team.</p><p>We are a YCombinator startup and as a team, we are all tech-savvy, curious about new technologies, and really passionate about building something to make people work better.</p><p>We are doing it by building beautiful products that combine usability and visual design for great user experience.</p><p>We work really hard but we make sure we are all enjoying the ride.</p><strong>Job Description</strong><p>We are looking for a skilled React.js developer to join our development team and work on the Akiflow main app in Electron JS.</p><p>You will be responsible for developing and implementing user interface components using React.js concepts and workflows. You will also be responsible for profiling and improving front-end performance. You will also be responsible to interact with various rest API.</p><strong>Responsibilities</strong><ul><li>Developing and implementing highly-responsive user interface components using React.js.</li><li>Building reusable components and front-end libraries for future use.</li><li>Translating designs and wireframes into high-quality code.</li><li>Reviewing application requirements and interface designs.</li><li>Troubleshooting interface software and debugging application code.</li><li>Monitoring and improving front-end performance.</li><li>Managing application data structure.</li></ul><strong>Requirements</strong><ul><li>Previous experience working as a React.js/Node js Developer.</li><li>In-depth knowledge of JavaScript, CSS, HTML, and front-end languages.</li><li>Knowledge of React-related tools including React.js and Webpack.</li><li>Experience with data structure libraries (e.g., Immutable.js)</li><li>Familiarity with modern front-end build pipelines and tools.</li><li>Ability to understand business requirements and translate them into technical requirements.</li><li>Experience in frontend benchmarking and optimization.</li><li>Experience with code versioning tools.</li><li>Experience with browser-based debugging and performance testing software.</li><li>Experience in interacting with rest API.</li><li>Excellent troubleshooting skills.</li><li>Previous startup experience.</li><li>Excellente English knowledge.</li><li>Nice to have: experience with Electron Js.</li></ul><strong>What we offer</strong><ul><li>Strong startup culture with a supporting an inclusive environment.</li><li>Possibility to grow inside the company.</li><li>Full remote job.</li><li>Laptop, Headset.</li></ul>"
  },
  {
    "id": 4,
    "name": "ReactJS Developer",
    "job_title": "frontend engineer",
    "company_name": "Commvault Systems",
    "location": "United State",
    "company_market": "Healthcare",
    "type": "Part Time",
    "team_size": "51-99",
    "level": "Entry Level",
    "salary": "$100,000 – $150,000",
    "skills": [
      {
      "name": "React Native"
      }, {
        "name": "React.js"
      }
    ],
    "description": "<h3>ReactJS Developer</h3><p>We are looking for a highly skilled web developer with 5 to 10 years of industry experience to join our Engineering team at Metallic, a Commvault venture. In this role, you will be developing user interface components which is highly efficient, scalable, and has best user experience.</p><strong>Responsibilities</strong><ul><li>Working with product managers in understanding the feature requirement end to end.</li><li>Breaking down user stories into tasks.</li><li>Reviewing the mock-up screens provided by the UX team, providing any valuable feedbacks, and implementing the UI components for the same.</li><li>Cooperating with the back-end developer in the process of building the RESTful APIs</li><li>Delivering high quality, robust, and accessible user interface.</li><li>Writing unit test cases to achieve good code coverage.</li><li>Reviewing co-developer’s pull requests.</li><li>Helping SRE team in monitoring the website health and improving the performance.</li><li>Contributing to core UI component library by building re-usable and optimized components.</li><li>Co-ordinating with other team members and demonstrating the feature to QA, SRE and solution engineers.</li><li>Closely working with QA/Support team to fix the issues in a timely manner.</li></ul><strong>Requirements</strong><ul><li>Proficiency in JavaScript, CSS, HTML.</li><li>Min. 5 years of industry experience in web application development using any of the well-known frameworks like ReactJS, Angular, AngularJS, etc.</li><li>Min. 2 years of hands-on experience in ReactJS.</li><li>Experience in migrating large scale web application from AngularJS to ReactJS or any similar migration.</li><li>Creative thinking in UI design and knowledge in design patterns.</li><li>Ability to architect the solution for a large-scale application.</li><li>Experience in improving the website performance globally and knowledge in CDN.</li><li>Experience in responsive UI development using Bootstrap, Material, or any UI library.</li><li>Experience in CSS pre-processors like SCSS, SASS, or LESS.</li><li>Experience in testing frameworks like Jest, Jasmine, Karma.</li><li>Experience with browser-based debugging and performance testing tools. E.g., Google Lighthouse for Chrome.</li><li>Knowledge in micro front-end architecture.</li><li>Experience in CI/CD and knowledge in serverless deployments.</li><li>Understanding in website security vulnerabilities (e.g., XSS, CSRF)</li><li>Excellent troubleshooting skills.</li><li>Knowledge in Azure portal, Azure DevOps, GitLab is an added advantage.</li></ul>"
  },
  {
    "id": 5,
    "name": "Senior Software Engineer (Node.js / React.js)",
    "job_title": "software engineer",
    "company_name": "Learning Tapestry",
    "location": "Anywhere",
    "company_market": "Healthcare",
    "type": "Contract",
    "team_size": "1-10",
    "level": "Senior Level",
    "salary": "$100,000 – $150,000",
    "skills": [
      {
      "name": "Node.js"
      }, {
        "name": "React.js"
      }, {
        "name": "Javascript"
      }
    ],
    "description": "<h3>Senior Software Engineer (Node.js / React.js)</h3><p>Learning Tapestry is an engineering and consulting agency building the future of education.</p><p>We believe in working remotely, flexible work arrangements and delivering great work.</p><p>We’re looking for a Software Engineer with experience in Node.js and React.js.</p><strong>Required Skills and Experience</strong><ol><li>You have either: Computer Science or Engineering degree or other STEM degree, or Exceptional professional software engineer experience and expertise</li><li>Senior in solution design and architecture</li><li>Senior in Node.js development</li><li>Experienced in React.js development</li><li>Experience building interactive applications using JavaScript and HTML/CSS.</li><li>DevOps/Linux experience with WS / Azure / Rackspace / Heroku / DigitalOcean</li><li>Continuous Integration and Deployment experience (e.g., CodeShip, Cloud66)</li><li>You have very good written communication skills, fluent written English, and comfortable, clear spoken English.</li><li>At least five years of Software Engineering Experience.</li><li>Write clean, self-explanatory code using S.O.L.I.D. and design patterns</li><li>Experience consuming APIs</li><li>Experience with SQL DBs. Specifically experience with Postgres a plus, as we use mainly Postgres.</li><li>Experience working in collaborative environment using git (e.g. GitHub).</li><li>Comfortable using ticket-based technical project management (e.g., GitHub tickets and boards)</li><li>Must be able to overlap at least 4 hours with our client in New York (UTC -5) and as needed with California (UTC -8)</li></ol><strong>To Apply: </strong><p>Apply with your resume and in your cover letter please confirm that you are available per the hours described in the job description.</p><strong>Equal Opportunity:</strong><p>Learning Tapestry is an equal opportunity employer and encourages individuals of all ethnic and racial backgrounds, sexual orientations, and gender identities to apply. We are also particularly interested in individuals who have lived in or worked with underserved communities such as low-income, gender nonconforming, disabled, or indigenous peoples.</p>"
  },
  {
    "id": 6,
    "name": "Senior Engineer",
    "job_title": "software engineer",
    "company_name": "Toptal",
    "location": "Anywhere",
    "company_market": "Marketplaces",
    "type": "Full Time",
    "team_size": "100+",
    "level": "Senior Level",
    "salary": "$25,000 - $50,000",
    "skills": [
      {
        "name": "HTML"
      }, {
        "name": "CSS"
      }, {
        "name": "Javascript"
      }, {
        "name": "Node.js"
      }
    ],
    "description": "<h3>Senior Engineer</h3><strong>About the role</strong><p>We're looking for a creative engineer to join our early team! You'll work closely with the co-founders and defining the product roadmap together and have a lot of room for flexibility.</p><strong>What you'll be doing at Chisel:</strong><ul><li>Owning ideas from inception to execution</li><li>Working directly with founders to define the product and engineering roadmap</li><li>Designing and implementing backend functionality, DB architecture, and more</li><li>Building out core social features on front-end interfaces to enhance engagement</li></ul><strong>Technical skills we'd love to see:</strong><ul><li>You have shipped full-stack products before - whether it was in your day job or projects outside of work</li><li>You have experience working across the stack with frameworks like React, Node.js, databases (Neo4J. or relational), and platforms like AWS</li><li>You embrace Serverless technology and containers</li><li>You have 3+ years experience working on full-stack projects</li><li>You have experience in small startup environments</li></ul><strong>Benefits</strong><ul><li>Health/Dental/Vision</li><li>Unlimited vacation policy</li><li>Paid lunches</li><li>Travel budget</li><li>Equity Package</li></ul><strong>Salary Range</strong><p>Since we're just starting out, we can't offer any eye-popping salaries but we plan to start this off around $76,000-$83,000.</p>"
  }
]
