[
  {
    "id": 1,
    "name": "Backend Web Developer (Ruby on Rails)",
    "job_title": "backend engineer",
    "company_name": "Toptal",
    "location": "Anywhere",
    "company_market": "Software house",
    "type": "Full Time",
    "team_size": "1-10",
    "level": "Mid Level",
    "salary": "$12,000 - $25,000",
    "skills": [
      {
      "name": "HTML"
      }, {
        "name": "CSS"
      }, {
        "name": "Javascript"
      }, {
        "name": "Ruby on Rails"
      }
    ],
    "description": "<h3>Clevertech is hiring a Remote Senior Full Stack Engineer JavaScript</h3><p>Our 100% remote team of 200+ CleverPeople are seasoned yet friendly professionals who want to collaborate and welcome you. We have an exciting new opening for a Senior Full Stack Engineer - Javascript .</p><p>What we're working on Enterprise companies turn to us to help them launch innovative digital products that interact with hundreds of millions of customers, transactions and data points. The problems we solve everyday are real and require creativity, grit and determination. We are building a culture that challenges norms while fostering experimentation and personal growth. We are hiring team members who are passionate and energized by the vision of empowering our customers in a complex industry through technology, data and a deep understanding of client concerns. In order to grasp the scale of problems we face, ideally you have some exposure to Logistics, FinTech, Transportation, Insurance, Media or other complex multifactor industries.</p><strong>Requirements</strong><ul><li>7+ years of professional experience (A technical assessment will be required)</li><li>Senior-level experience in the front-end (React) and back-end (Node, Express Mongo, SQL)</li><li>Ability to create clean, modern, testable, well-documented code</li><li>English fluency, verbal and written</li><li>Professional, empathic, team player</li><li>Problem solver, proactive, go getter</li><li>Be sure to mention the words CLOG REGION DIRECT when applying to show you read the job post completely. This is a beta feature to avoid spam applicants.</li></ul><strong>Salary and compensation</strong><p>$60,000 — $100,000</p><strong>Location</strong><p>🌏 Worldwide</p>"
  },
  {
    "id": 2,
    "name": "Software Engineer",
    "job_title": "software engineer",
    "company_name": "OarRx",
    "location": "Anywhere",
    "company_market": "Software house",
    "type": "Full Time",
    "team_size": "11-50",
    "level": "Mid Level",
    "salary": "$100,000 - $150,000",
    "skills": [
      {
      "name": "Ruby on Rails"
      }, {
        "name": "React Native"
      }
    ],
    "description": "<h3>Software Engineer</h3><p>We are searching for a diligent, hungry-to-learn software developer to join Oar as an Engineer. As a member of our engineering team, you will collaborate with our product and design teams to bring new features to life, building beautiful and interactive experiences that help Oar’s consumers confront addiction and compulsion. Plus, you will work with a talented, diverse team united by its common values: empathy, acceptance, expertise, innovation, integrity, and high performance.</p><p>What excites us about you?</p><ul><li>You are mission-driven, bringing a passion for helping the millions of people who struggle with addiction and compulsion</li><li>You have about 3+ years experience as software developer</li><li>You have familiarity with a smorgasbord of tools. Our favorites include SQL, Heroku, Git, Ruby/Ruby on Rails, HTML5, CSS3, Javascript, and/or React/Redux responsive web design</li><li>You have an entrepreneurial spirit and think proactively about broader business and customer goals</li><li>You like to rely on your keen problem-solving abilities to creatively and efficiently extinguish unexpected challenges</li><li>You are able to build quickly but also have a sense of architecture that can scale well beyond small beta launches</li><li>You enjoy working collaboratively, within a common framework, to build intuitive solutions to complex problems</li><li>You’re intellectually curious, willing to jump into existing projects and learn on the fly</li><li>You bring high conscientiousness, attention to detail, and strong organizational skills</li></ul><p>How we support you:</p><ul><li>Competitive salary</li><li>Paid health insurance coverage</li><li>401k contribution</li><li>MacBook Pro</li><li>Health and Wellness reimbursement</li><li>Commuter benefits</li><li>Complimentary team lunches</li><li>Fun team outings</li><li>Generous vacation time</li></ul>"
  },
  {
    "id": 3,
    "name": "React JS Developer (YCombinator backed startup)",
    "job_title": "frontend engineer",
    "company_name": "Akiflow",
    "company_market": "Software house",
    "location": "Europe",
    "type": "Contract",
    "team_size": "1-10",
    "level": "Mid Level",
    "salary": "$50,000 - $100,000",
    "skills": [
      {
      "name": "Node.js"
      }, {
        "name": "Javascript"
      }, {
        "name": "TypeScript"
      }, {
        "name": "React.js"
      }
    ],
    "description": "<p>We are building Akiflow.com (https://akiflow.com/), and we are looking for a React Developer to join our fully-remote international team.</p><p>We are a YCombinator startup and as a team, we are all tech-savvy, curious about new technologies, and really passionate about building something to make people work better.</p><p>We are doing it by building beautiful products that combine usability and visual design for great user experience.</p><p>We work really hard but we make sure we are all enjoying the ride.</p><strong>Job Description</strong><p>We are looking for a skilled React.js developer to join our development team and work on the Akiflow main app in Electron JS.</p><p>You will be responsible for developing and implementing user interface components using React.js concepts and workflows. You will also be responsible for profiling and improving front-end performance. You will also be responsible to interact with various rest API.</p><strong>Responsibilities</strong><ul><li>Developing and implementing highly-responsive user interface components using React.js.</li><li>Building reusable components and front-end libraries for future use.</li><li>Translating designs and wireframes into high-quality code.</li><li>Reviewing application requirements and interface designs.</li><li>Troubleshooting interface software and debugging application code.</li><li>Monitoring and improving front-end performance.</li><li>Managing application data structure.</li></ul><strong>Requirements</strong><ul><li>Previous experience working as a React.js/Node js Developer.</li><li>In-depth knowledge of JavaScript, CSS, HTML, and front-end languages.</li><li>Knowledge of React-related tools including React.js and Webpack.</li><li>Experience with data structure libraries (e.g., Immutable.js)</li><li>Familiarity with modern front-end build pipelines and tools.</li><li>Ability to understand business requirements and translate them into technical requirements.</li><li>Experience in frontend benchmarking and optimization.</li><li>Experience with code versioning tools.</li><li>Experience with browser-based debugging and performance testing software.</li><li>Experience in interacting with rest API.</li><li>Excellent troubleshooting skills.</li><li>Previous startup experience.</li><li>Excellente English knowledge.</li><li>Nice to have: experience with Electron Js.</li></ul><strong>What we offer</strong><ul><li>Strong startup culture with a supporting an inclusive environment.</li><li>Possibility to grow inside the company.</li><li>Full remote job.</li><li>Laptop, Headset.</li></ul>"
  },
  {
    "id": 4,
    "name": "ReactJS Developer",
    "job_title": "frontend engineer",
    "company_name": "Commvault Systems",
    "location": "United State",
    "company_market": "Healthcare",
    "type": "Part Time",
    "team_size": "51-99",
    "level": "Entry Level",
    "salary": "$100,000 - $150,000",
    "skills": [
      {
      "name": "React Native"
      }, {
        "name": "React.js"
      }
    ],
    "description": "<h3>ReactJS Developer</h3><p>We are looking for a highly skilled web developer with 5 to 10 years of industry experience to join our Engineering team at Metallic, a Commvault venture. In this role, you will be developing user interface components which is highly efficient, scalable, and has best user experience.</p><strong>Responsibilities</strong><ul><li>Working with product managers in understanding the feature requirement end to end.</li><li>Breaking down user stories into tasks.</li><li>Reviewing the mock-up screens provided by the UX team, providing any valuable feedbacks, and implementing the UI components for the same.</li><li>Cooperating with the back-end developer in the process of building the RESTful APIs</li><li>Delivering high quality, robust, and accessible user interface.</li><li>Writing unit test cases to achieve good code coverage.</li><li>Reviewing co-developer’s pull requests.</li><li>Helping SRE team in monitoring the website health and improving the performance.</li><li>Contributing to core UI component library by building re-usable and optimized components.</li><li>Co-ordinating with other team members and demonstrating the feature to QA, SRE and solution engineers.</li><li>Closely working with QA/Support team to fix the issues in a timely manner.</li></ul><strong>Requirements</strong><ul><li>Proficiency in JavaScript, CSS, HTML.</li><li>Min. 5 years of industry experience in web application development using any of the well-known frameworks like ReactJS, Angular, AngularJS, etc.</li><li>Min. 2 years of hands-on experience in ReactJS.</li><li>Experience in migrating large scale web application from AngularJS to ReactJS or any similar migration.</li><li>Creative thinking in UI design and knowledge in design patterns.</li><li>Ability to architect the solution for a large-scale application.</li><li>Experience in improving the website performance globally and knowledge in CDN.</li><li>Experience in responsive UI development using Bootstrap, Material, or any UI library.</li><li>Experience in CSS pre-processors like SCSS, SASS, or LESS.</li><li>Experience in testing frameworks like Jest, Jasmine, Karma.</li><li>Experience with browser-based debugging and performance testing tools. E.g., Google Lighthouse for Chrome.</li><li>Knowledge in micro front-end architecture.</li><li>Experience in CI/CD and knowledge in serverless deployments.</li><li>Understanding in website security vulnerabilities (e.g., XSS, CSRF)</li><li>Excellent troubleshooting skills.</li><li>Knowledge in Azure portal, Azure DevOps, GitLab is an added advantage.</li></ul>"
  },
  {
    "id": 5,
    "name": "Senior Software Engineer (Node.js / React.js)",
    "job_title": "software engineer",
    "company_name": "Learning Tapestry",
    "location": "Anywhere",
    "company_market": "Healthcare",
    "type": "Contract",
    "team_size": "1-10",
    "level": "Senior Level",
    "salary": "$100,000 - $150,000",
    "skills": [
      {
      "name": "Node.js"
      }, {
        "name": "React.js"
      }, {
        "name": "Javascript"
      }
    ],
    "description": "<h3>Senior Software Engineer (Node.js / React.js)</h3><p>Learning Tapestry is an engineering and consulting agency building the future of education.</p><p>We believe in working remotely, flexible work arrangements and delivering great work.</p><p>We’re looking for a Software Engineer with experience in Node.js and React.js.</p><strong>Required Skills and Experience</strong><ol><li>You have either: Computer Science or Engineering degree or other STEM degree, or Exceptional professional software engineer experience and expertise</li><li>Senior in solution design and architecture</li><li>Senior in Node.js development</li><li>Experienced in React.js development</li><li>Experience building interactive applications using JavaScript and HTML/CSS.</li><li>DevOps/Linux experience with WS / Azure / Rackspace / Heroku / DigitalOcean</li><li>Continuous Integration and Deployment experience (e.g., CodeShip, Cloud66)</li><li>You have very good written communication skills, fluent written English, and comfortable, clear spoken English.</li><li>At least five years of Software Engineering Experience.</li><li>Write clean, self-explanatory code using S.O.L.I.D. and design patterns</li><li>Experience consuming APIs</li><li>Experience with SQL DBs. Specifically experience with Postgres a plus, as we use mainly Postgres.</li><li>Experience working in collaborative environment using git (e.g. GitHub).</li><li>Comfortable using ticket-based technical project management (e.g., GitHub tickets and boards)</li><li>Must be able to overlap at least 4 hours with our client in New York (UTC -5) and as needed with California (UTC -8)</li></ol><strong>To Apply: </strong><p>Apply with your resume and in your cover letter please confirm that you are available per the hours described in the job description.</p><strong>Equal Opportunity:</strong><p>Learning Tapestry is an equal opportunity employer and encourages individuals of all ethnic and racial backgrounds, sexual orientations, and gender identities to apply. We are also particularly interested in individuals who have lived in or worked with underserved communities such as low-income, gender nonconforming, disabled, or indigenous peoples.</p>"
  },
  {
    "id": 6,
    "name": "Senior Engineer",
    "job_title": "software engineer",
    "company_name": "Toptal",
    "location": "Anywhere",
    "company_market": "Marketplaces",
    "type": "Full Time",
    "team_size": "100+",
    "level": "Senior Level",
    "salary": "$25,000 - $50,000",
    "skills": [
      {
        "name": "HTML"
      }, {
        "name": "CSS"
      }, {
        "name": "Javascript"
      }, {
        "name": "Node.js"
      }
    ],
    "description": "<h3>Senior Engineer</h3><strong>About the role</strong><p>We're looking for a creative engineer to join our early team! You'll work closely with the co-founders and defining the product roadmap together and have a lot of room for flexibility.</p><strong>What you'll be doing at Chisel:</strong><ul><li>Owning ideas from inception to execution</li><li>Working directly with founders to define the product and engineering roadmap</li><li>Designing and implementing backend functionality, DB architecture, and more</li><li>Building out core social features on front-end interfaces to enhance engagement</li></ul><strong>Technical skills we'd love to see:</strong><ul><li>You have shipped full-stack products before - whether it was in your day job or projects outside of work</li><li>You have experience working across the stack with frameworks like React, Node.js, databases (Neo4J. or relational), and platforms like AWS</li><li>You embrace Serverless technology and containers</li><li>You have 3+ years experience working on full-stack projects</li><li>You have experience in small startup environments</li></ul><strong>Benefits</strong><ul><li>Health/Dental/Vision</li><li>Unlimited vacation policy</li><li>Paid lunches</li><li>Travel budget</li><li>Equity Package</li></ul><strong>Salary Range</strong><p>Since we're just starting out, we can't offer any eye-popping salaries but we plan to start this off around $76,000-$83,000.</p>"
  },
  {
    "id": 7,
    "name": "Senior Software Engineer",
    "job_title": "software engineer",
    "company_name": "Toptal",
    "location": "Europe",
    "company_market": "Cryptocurrency and Blockchain",
    "type": "Full Time",
    "team_size": "100+",
    "level": "Senior Level",
    "salary": "$100,000 - $150,000",
    "skills": [
      {
        "name": "HTML"
      }, {
        "name": "Javascript"
      }, {
        "name": "React.js"
      }, {
        "name": "Vue.js"
      }
    ],
    "description": "<h3>Senior Software Engineer</h3><p>We are looking to build out our engineering team with a senior full-stack developer. You will be responsible for working with the team lead to ship code and scale our application as part of a fast growing company working in the electrical services industry. Ideally, you’re comfortable working in React and Java or able to pick up both quickly and thrive working as part of a small team taking on lots of responsibility. We’re a small group looking for someone who will be hands on from day one.</p><strong>What you’ll do</strong><ul><li>Build software for electricians on a React and Spring Boot stack hosted on AWS</li><li>Some days work independently, taking ownership of new feature work from start to finish</li><li>Other days pair with your team members, working together to write code</li><li>Collaborate with a wide range of team members in product, design, and engineering management</li></ul><strong>What you bring to the role</strong><ul><li>Typically 3-4 years of experience shipping high quality production code</li><li>Strong understanding of OOP and software application design best practices</li><li>Knowledge of relational databases, data modeling, and SQL query design</li><li>Understanding of one or more MVC (Spring Boot, Rails, Django) and frontend (React, Vue) frameworks</li><li>Previous experience with AWS and Kubernetes. Additional dev ops experience a plus.</li><li>Willingness to work and collaborate remotely</li><li>Comfort with Git and Github workflows</li></ul><strong>About Coil:</strong><p>Coil, Inc. is revolutionizing the electrical industry through innovation, enabling the future of renewable energy. We partner with OEMs, channel partners, and other service providers to identify, install, and provide the best electrical solutions. Coil, Inc. serves thousands of customers and businesses nationally through its two business units: Coil Electric, a premier, full service electrical installer specializing in new energy installations, and COIL iQ, a software management tool for Electricians & the Renewables Industry.</p><p>Coil, Inc. is committed to building diverse teams. All applicants will receive consideration without regard to race, color, ancestry, sex, religion, gender, gender identity or expression, sexual orientation, marital status, national origin, citizenship, genetics, disability, age, veteran status or other characteristics. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please notify us to request accommodation.</p>"
  },
  {
    "id": 8,
    "name": "Software Engineer, Frontend",
    "job_title": "frontend engineer",
    "company_name": "Toptal",
    "location": "Anywhere",
    "company_market": "Cryptocurrency and Blockchain",
    "type": "Full Time",
    "team_size": "100+",
    "level": "Senior Level",
    "salary": "$100,000 - $150,000",
    "skills": [
      {
        "name": "HTML"
      }, {
        "name": "Javascript"
      }, {
        "name": "React.js"
      }
    ],
    "description": "<h3>Software Engineer, Frontend</h3><p>Our mission at Juked is to bring esports fans closer together. We’re building a new social network where esports fans from every game and genre will convene in one place, for the first time, to forge new relationships, drive deeper connections, and experience the electric moments that make up the esports we love—together.</p><p>We are well on our way to making this mission a reality, and are seeking a Frontend Engineer with React/React Native experience to help us build the new home for esports fans. You will work with state of the art technologies to develop a social media platform that services millions of people. As a member of our engineering team, you will play a significant role in building and shaping our product. Your work will be critical to our success.</p><p>If you are excited about creating an open, inclusive, and positive future for the esports community and want to be part of a talented and passionate founding team, come join us at Juked!</p><strong>As a Frontend Engineer, you will:</strong><ul><li>Work with the engineering team to develop high quality mobile and web products with the rest of the engineering team</li><li>Take ownership of your code and become the expert in your segment of the product</li><li>Collaborate with designers and the product team to develop delightful interfaces and experiences</li><li>Tackle challenging social features at scale: improve our content feed, implement live chat during esports events, or contribute to our anti-toxicity moderation technology</li><li>Dive into the unknown alongside a similarly driven team of creators. Communication, collaboration, respect, and adaptability are key tenets of this squad.</li></ul><strong>What you’ll bring to our team</strong><ul><li>A fresh perspective on how to solve the challenges of building the Juked products</li><li>Ability to work effectively in a team setting, including creatively turning abstract ideas into concrete design solutions</li><li>3+ years experience as a software developer building scalable mobile and/or web apps</li><li>2+ years experience writing Javascript (ES6+) and using React, preferably with Typescript</li><li>Passion for esports, gaming, or online communities</li></ul><strong>Bonus Points</strong><ul><li>Experience with mobile programming languages (Swift, Java, Kotlin, Objective-C) and/or React Native</li><li>Have built a gaming or esports related side project</li><li>Excited to tackle the unknown</li><li>Desire to grow with the product and challenge yourself regularly</li></ul><strong>What We Offer At Juked</strong><ul><li>A chance to work on solutions that improve the daily life of esports fans—from building novel ways to connect and chat, making it easier to stay connected to the biggest moments from their favorite games and teams, to creating a safe, open, and inclusive environment for discussion.</li><li>A passionate, exceptional, and closed-knit team that loves video games</li><li>A place where your ideas and your voice will be heard, and your hard work will be instrumental to the success of the company</li><li>An opportunity to build innovative products that will have a lasting impact on the lives of esports fans</li><li>A fast-paced and fun working environment</li><li>Benefits including Medical insurance (Health, Dental, Vision) and 401K</li><li>Substantial equity ownership in a fast growing startup</li></ul><strong>About Juked</strong><p>We’re passionate esports fans to the very core of our DNA: founders Ben & Chris have 25+ combined years of experience in leading entrepreneurial roles in the industry (including the founding team at Twitch), and are both former competitive players, commentators, content creators, and tournament organizers.</p><p>We launched Juked in November 2019 as the best way to Discover, Watch, and Follow the esports you care about, and our web product now reaches more 50,000 unique users per month. We are taking the next step to make Juked part of the daily habit of 500+ million esports fans around the world with our upcoming mobile application and our renewed focus on building the social and community hub for esports.</p><p>Esports is growing like crazy, but we at Juked know that esports is still in its infancy and has decades of exponential growth ahead. We're aiming to play a massive role in that evolution.</p>"
  },
  {
    "id": 9,
    "name": "Software Engineer",
    "job_title": "software engineer",
    "company_name": "Commvault Systems",
    "location": "Anywhere",
    "company_market": "Ecommerce",
    "type": "Part Time",
    "team_size": "1-10",
    "level": "Senior Level",
    "salary": "$100,000 - $150,000",
    "skills": [
      {
        "name": "HTML"
      }, {
        "name": "Javascript"
      }, {
        "name": "React.js"
      }
    ],
    "description": "<p>As a Happiness Support Engineer, you love helping people.</p><p>Transforming publishing on the web is no small task. Our goal is to build relationships based on trust, resulting in happy, passionate, loyal customers and colleagues. We do this by listening to our customers’ needs and guiding them to the fullest use of the products we offer. We are looking for people with the right mix of compassion, writing skills, and technical knowledge to get the job done.</p><p>Are you interested in learning more about how our team works? Check out what Happiness Support Engineers have to say about their work.</p><strong>In general, a typical day involves:</strong><ul><li>Being an active member of a global team that provides 24/7 support via live chat, tickets, one-on-one screen share sessions, and forums.</li><li>Helping people use Automattic’s products, including WordPress.com, WooCommerce, Jetpack, Tumblr, and more.</li><li>Troubleshooting, investigating, and creating detailed bug reports.</li><li>Building a community of support by sharing knowledge and helping team members around the world.</li></ul><strong>Being a Happiness Support Engineer requires:</strong><ul><li>Mid to high proficiency with HTML, and CSS.</li><li>Experience providing technical support to customers, particularly via live chat, tickets, telephone, or forums.</li><li>Excellent written and communication skills, with a knack for taking technical language and making it understandable for the general public.</li><li>A passion for solving challenging problems and proposing elegant solutions.</li><li>Solid ability to identify and accurately document technical issues.</li><li>An intense intellectual curiosity and an eagerness to share knowledge with others.</li><li>Patience, grace, and a sense of humor.</li><li>Sr Happiness Support Engineers must be fluent and eloquent in written English. If you know additional languages, please be sure to tell us.</li></ul><strong>An ideal candidate</strong><ul><li>Has created three or more WordPress websites.</li><li>Has experience installing and configuring WordPress plugins and themes.</li><li>Is adept at troubleshooting technical issues.</li><li>Has experience creating bug reports.</li><li>Has experience providing technical support to customers via telephone, tickets, live chat, or forums.</li></ul>"
  },
  {
    "id": 10,
    "name": "Senior Software Engineer",
    "job_title": "software engineer",
    "company_name": "Commvault Systems",
    "location": "Anywhere",
    "company_market": "Ecommerce",
    "type": "Contract",
    "team_size": "1-10",
    "level": "Senior Level",
    "salary": "$100,000 - $150,000",
    "skills": [
      {
        "name": "Ruby on Rails"
      }, {
        "name": "Javascript"
      }, {
        "name": "React.js"
      }
    ],
    "description": "<p>DockYard is hiring a Senior Swift Open Source Engineer. This role will be dedicated to working on a high-value open source project and report directly to the Director of Research & Development at DockYard.</p><strong>Who We Are</strong><p>DockYard is a digital product consultancy specializing in production-ready apps. DockYard offers a range of consulting services with capabilities in product planning, design, user experience (UX), full-stack engineering, and QA. Over the last decade, the company has solved complex product challenges for visionary brands like Netflix, Apple, Nasdaq, and Harvard.</p><p>We’re honored to have been included on guides ranging from Inc 5000 (2020, 2019) to Fast Company’s Best Places to Work for Innovators (2020) amongst others.</p><strong>The Role</strong><p>In this role, you will be tasked with working on a Swift and SwiftUI open source project that will be highly visible and of high value to DockYard. You will be involved with the architecture and implementation of a high-value open source project.</p><p>The ideal candidate is a self-starter and independent engineer who enjoys contributing to open-source projects. Having a demonstrable open source contribution record in Swift and SwiftUI projects will be a plus.</p><strong>Responsibilities</strong><ul><li>Reporting directly and in coordination with the Dir of R&D</li><li>Implementing a Swift/SwiftUI Open Source project</li><li>Contributing back to supporting libraries that enhance said project</li></ul><strong>Must Haves</strong><ul><li>2 – 3 years of Swift experience</li><li>1 – 2 years of SwiftUI experience</li><li>A desire to build well tested and battle-hardened code</li><li>Existing open-source projects in Swift/SwiftUI</li></ul>"
  }
]
